# linear-regression-exercise-ii

Use the "Run" button to execute the code.

In [1]:
!pip install jovian --upgrade --quiet

In [2]:
import jovian

In [3]:
# Execute this to save new versions of the notebook
jovian.commit(project="linear-regression-exercise-ii")

[jovian] Updating notebook "kishkath/linear-regression-exercise-ii" on https://jovian.ai
[jovian] Committed successfully! https://jovian.ai/kishkath/linear-regression-exercise-ii

'https://jovian.ai/kishkath/linear-regression-exercise-ii'

## Requirement : 


In exercise folder (same level as this notebook on github) there is hiring.csv. This file contains hiring statics for a firm such as experience of candidate, his written test score and personal interview score. Based on these 3 factors, HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide salaries for future candidates. Using this predict salaries for following candidates:

2 yr experience, 9 test score, 6 interview score

12 yr experience, 10 test score, 10 interview score

### Libraries

In [13]:
import pandas as pd
import numpy as np
import math
from sklearn import linear_model
from word2number import w2n

## Data

In [9]:
data = pd.read_csv("https://raw.githubusercontent.com/codebasics/py/master/ML/2_linear_reg_multivariate/Exercise/hiring.csv")

In [11]:
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

### Data PreProcessing

In [17]:
data.iloc[:,1] = data.iloc[:,1].fillna(data.iloc[:,1].median())

In [18]:
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

- Assume, each candidate number represents to respective index(just for filling the null values of experience column).



- As for third candidate we can see, for experience of 2 years with out of out marks in test and interview, he got the salary of 65k. 
- As for second candidate with 5 years of experience with 6 marks in test and 7 marks in interview, got the salary of 60k.

- Now, for the fifth candidate who has 3 years of experience with 7 marks in test and 10 marks in interview, got the salary of 62k.
- Let us assume, the cutoff salary be 60k.

- As the 0th and 1st candidate has less salary than cutoff salary. we can conclude, they are not such experienced. 

- Also, look at the marks of 0th and 1st candidate they are high, if they are experienced with such marks they would earned huge salary.

- So, we can conclude they are not more experienced than 2-3 years.

- Lets look at person with 2 years of experience who has salary of 65k, with out of out marks. Consider he would have scored less(more than 5 less than 9), then he would have earned less salary lets say as 50-60K. If he would have scored similar to 0th candidate he has more probablity of getting the salary more than 60K.

- So, with this we can get near to experience of 0th and 1st candidates, which can be 0 or 1.

- The both candidates are near to each other, only becoz of interview score 1st candidate has secured less salary. so we can consider both candidates are equally experienced.

- Lets us take the first case: Both are 1 yr experienced, with that score comparing with 3rd candidate, surely the 0th candidate would have got salary more than 50-55k. Lets put the 1st candidate away.

- Now, with this we can consider both as zero experienced.

In [23]:
data.experience = data.experience.fillna("one")

In [35]:
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [36]:
data.experience = data.experience.apply(w2n.word_to_num)
data

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

### Model Building

In [38]:
model = linear_model.LinearRegression()
model.fit(data.iloc[:,:3],data['salary($)'])

LinearRegression()

## Predict

In [59]:
first_prediction = model.predict([[2,9,6]])

/opt/conda/lib/python3.9/site-packages/sklearn/base.py:441: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

In [57]:
second_prediction = model.predict([[12,10,10]])

/opt/conda/lib/python3.9/site-packages/sklearn/base.py:441: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

### Add Paramters and loss values to dataset

In [72]:
df1 = {'experience': 2.0, 'test_score(out of 10)':9.0,'interview_score(out of 10)': 6.0, 'salary($)': first_prediction}
data.loc[8] = df1

In [73]:
df2 = {'experience': 12.0, 'test_score(out of 10)':10.0,'interview_score(out of 10)': 10.0, 'salary($)': second_prediction}
#data.append(df2,ignore_index = True)

In [74]:
data.loc[9] = df2

In [79]:
data

,experience,test_score(out of 10),interview_score(out of 10),salary($)
0,0.0,8.0,9.0,50000
1,0.0,8.0,6.0,45000
2,5.0,6.0,7.0,60000
3,2.0,10.0,10.0,65000
4,7.0,9.0,6.0,70000
5,3.0,7.0,10.0,62000
6,10.0,8.0,7.0,72000
7,11.0,7.0,8.0,80000
9,12.0,10.0,10.0,[92002.18340611355]
8,2.0,9.0,6.0,[53205.96797671032]

In [80]:
jovian.commit(project_name='linear-regression-exercise-ii')

[jovian] Updating notebook "kishkath/linear-regression-exercise-ii" on https://jovian.ai
[jovian] Committed successfully! https://jovian.ai/kishkath/linear-regression-exercise-ii

'https://jovian.ai/kishkath/linear-regression-exercise-ii'